import config from '../../config.cjs';

const ping = async (m, sock) => {
  const prefix = config.PREFIX;
const cmd = m.body.startsWith(prefix) ? m.body.slice(prefix.length).split(' ')[0].toLowerCase() : '';
const text = m.body.slice(prefix.length + cmd.length).trim();

  if (cmd === "menu") {
    const start = new Date().getTime();
    await m.React('✨');
    const end = new Date().getTime();
    const responseTime = (end - start) / 1000;

    const text = `
╭┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄❑
┋✪ ʙᴏᴛ ɴᴀᴍᴇ:*ɴᴇxᴜs xᴍᴅ*
┋✪ ᴠɪsɪᴏɴ: *3.𝟶.𝟶*
┋✪ ᴏᴡɴᴇʀ: *ᴍᴀʟᴠɪɴ ᴋɪɴɢ (🇿🇼)*    
┋✪ ᴘʟᴀᴛғᴏʀᴍ: *ʟɪɴᴜx*
┋✪ ᴍᴏᴅᴇ : *?*
┋✪ ᴘʀᴇғɪx: [.]
┋✪ ᴛʜᴇᴍᴇ:*ɴᴇxᴜs*
╰┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈❑

   ❐ 𝙾𝚆𝙽𝙴𝚁 𝙼𝙴𝙽𝚄 ❐
╭┈┈┈┈┈┈┈┈┈┈┈┈┈┈
┊ .ᴊᴏɪɴ
┊ .ʟᴇᴀᴠᴇ
┊ .ʙʟᴏᴄᴋ
┊ .ᴜɴʙʟᴏᴄᴋ
┊ .sᴇᴛᴘᴘʙᴏᴛ
┊ .ᴀɴᴛɪᴄᴀʟʟ
┊ .sᴇᴛsᴛᴀᴛᴜs
┊ .sᴇᴛɴᴀᴍᴇʙᴏᴛ
┊ .ᴀᴜᴛᴏᴛʏᴘɪɴɢ
┊ .ᴀʟᴡᴀʏsᴏɴʟɪɴᴇ
┊ .ᴀᴜᴛᴏʀᴇᴀᴅ
┊ .ᴀᴜᴛᴏsᴠɪᴇᴡ
╰┈┈┈┈┈┈┈┈┈┈┈┈┈❑

 ❐ 𝙲𝙾𝙽𝚅𝙴𝚁𝚃𝙴𝚁 𝙼𝙴𝙽𝚄 ❐
╭┄┄┄┄┄┄┄┄┄┄┄┄┄┄
┊ .ᴀᴛᴛᴘ
┊ .ᴀᴛᴛᴘ2
┊ .ᴀᴛᴛᴘ3
┊ .ᴇʙɪɴᴀʀʏ
┊ .ᴅʙɪɴᴀʀʏ
┊ .ᴇᴍᴏᴊɪᴍɪx
┊ .ᴍᴘ3
╰┄┄┄┄┄┄┄┄┄┄┄┄┄❑

   ❐ 𝙰𝙸 𝙼𝙴𝙽𝚄 ❐
╭┄┄┄┄┄┄┄┄┄┄┄┄┄┄
┊ .ᴀɪ
┊ .ʙᴜɢ
┊ .ʀᴇᴘᴏʀᴛ
┊ .ɢᴘᴛ
┊ .ᴅᴀʟʟᴇ
┊ .ʀᴇᴍɪɴɪ
┊ .ɢᴇᴍɪɴɪ
╰┄┄┄┄┄┄┄┄┄┄┄┄┄❑

   ❐ 𝚃𝙾𝙾𝙻 𝙼𝙴𝙽𝚄 ❐
╭┄┄┄┄┄┄┄┄┄┄┄┄┄┄
┊ .ᴄᴀʟᴄᴜʟᴀᴛᴏʀ
┊ .ᴛᴇᴍᴘᴍᴀɪʟ
┊ .ᴄʜᴇᴄᴋᴍᴀɪʟ
┊ .ᴛʀᴛ
┊ .ᴛᴛs
╰┄┄┄┄┄┄┄┄┄┄┄┄┄❑

   ❐ 𝙶𝚁𝙾𝚄𝙿 𝙼𝙴𝙽𝚄 ❐
╭┄┄┄┄┄┄┄┄┄┄┄┄┄┄
┊ .ʟɪɴᴋɢᴄ
┊ .sᴇᴛᴘᴘɢᴄ
┊ .sᴇᴛɴᴀᴍᴇ
┊ .sᴇᴛᴅᴇsᴄ
┊ .ɢʀᴏᴜᴘ
┊ .ɢᴄsᴇᴛᴛɪɴs
┊ .ᴡᴇʟᴄᴏᴍᴇ
┊ .ᴀᴅᴅ
┊ .ᴋɪᴄᴋ
┊ .ʜɪᴅᴇᴛᴀɢ
┊ .ᴛᴀɢᴀʟʟ
┊ .ᴀɴᴛɪʟɪɴᴋ
┊ .ᴀɴᴛɪᴛᴏxɪᴄ
┊ .ᴘʀᴏᴍᴏᴛᴇ
┊ .ᴅᴇᴍᴏᴛᴇ
┊ .ɢᴇᴛʙɪᴏ𝙶𝚎
╰┄┄┄┄┄┄┄┄┄┄┄┄┄┄❑

   ❐ 𝙳𝙾𝚆𝙽𝙻𝙾𝙰𝙳 𝙼𝙴𝙽𝚄 ❐
╭┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
┊ .ᴀᴘᴋ
┊ .ғᴀᴄᴇʙᴏᴏᴋ
┊ .ᴍɪᴅᴇᴀғɪʀᴇ
┊ .ᴘɪɴᴛᴇʀᴇsᴛᴅʟ
┊ .ɢɪᴛᴄʟᴏɴᴇ
┊ .ɢᴅʀɪᴠᴇ
┊ .ɪɴsᴛᴀ
┊ .ʏᴛᴍᴘ3
┊ .ʏᴛᴍᴘ4
┊ .ᴘʟᴀʏ
┊ .sᴏɴɢ
┊ .ᴠɪᴅᴇᴏ
┊ .ʏᴛᴍᴘ3ᴅᴏᴄ
┊ .ʏᴛᴍᴘ4ᴅᴏᴄ
┊ .ᴛɪᴋᴛᴏᴋ
╰┈┈┈┈┈┈┈┈┈┈┈┈┈┈❑

   ❐ 𝚂𝙴𝙰𝚁𝙲𝙷 𝙼𝙴𝙽𝚄 ❐
╭┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
┊ .ᴘʟᴀʏ
┊ .ʏᴛs
┊ .ɪᴍᴅʙ
┊ .ɢᴏᴏɢʟᴇ
┊ .ɢɪᴍᴀɢᴇ
┊ .ᴘɪɴᴛᴇʀᴇsᴛ
┊ .ᴡᴀʟʟᴘᴀᴘᴇʀ
┊ .ᴡɪᴋɪᴍᴇᴅɪᴀ
┊ .ʏᴛsᴇᴀʀᴄʜ
┊ .ʀɪɴɢᴛᴏɴᴇ
┊ .ʟʏʀɪᴄs
╰┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄❑

   ❐ 𝙼𝙰𝙸𝙽 𝙼𝙴𝙽𝚄 ❐
╭┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
┊ .ᴘɪɴɢ
┊ .ᴀʟɪᴠᴇ
┊ .ᴏᴡɴᴇʀ
┊ .ᴍᴇɴᴜ
┋.ɪɴғᴏʙᴏᴛ
╰┄┄┄┄┄┄┄┄┄┄┄┄┄┄❑

   ❐ 𝚂𝚃𝙰𝙻𝙺 𝙼𝙴𝙽𝚄 ❐
╭┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
┊ .ᴛʀᴜᴇᴄᴀʟʟᴇʀ
┊ .ɪɴsᴛᴀsᴛᴀʟᴋ
┊ .ɢɪᴛʜᴜʙsᴛᴀʟᴋ
╰┉┈┈┈┈┈┈┈┈┈┈┈┈┈┈❐
  
ᴊᴏɪɴ ᴏᴜʀ ᴡᴀ ᴄʜᴀɴɴᴇʟ ғᴏʀ ᴍᴏʀᴇ ᴜᴘᴅᴀᴛᴇs`;
    sock.sendMessage(m.from, { text }, { quoted: m });
  }
}

export default ping;
